FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/ns_ЖурналАвито.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ns_ЖурналАвито</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_ВидыСобытийЖурнала</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/ns_ЖурналАвито/Ext/ManagerModule.bsl
Процедура ЗаписатьОшибкуВЖурнал(Событие, Описание, Данные = Неопределено, ВыводитьСообщение = Истина) Экспорт
	
	НоваяЗапись = РегистрыСведений.ns_ЖурналАвито.СоздатьМенеджерЗаписи();
	НоваяЗапись.Период = ТекущаяДата();
	НоваяЗапись.Событие = Событие;
	НоваяЗапись.Описание = Описание;
	НоваяЗапись.Данные = Данные;
	НоваяЗапись.Записать();

	Если ВыводитьСообщение Тогда
		ns_ОбщегоНазначения.СообщениеПользователю("Событие: " + Событие + " смотрите журнал Авито.");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьЖурнал() Экспорт
	НаборЗаписей = РегистрыСведений.ns_ЖурналАвито.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
КонецПроцедуры
